app/Controllers/Categorias.php

SELECT *
FROM `categorias`
WHERE `estado` = 1
---
    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('estado',$activo)->findAll();